{"keras_version": "2.0.7", "backend": "tensorflow", "config": [{"config": {"trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "filters": 32, "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "filters": 64, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"units": 10, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}